app/views/replies/_reply.html.erb

  <% user_id = reply.user_id %>
  <% the_user = User.find(user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]