app/views/comments/_comment.html.erb

      <p class="lead"><%= comment.body %></p>
      <p><strong><small><%= time_ago_in_words(comment.created_at) %> ago</strong> by <%= comment.user.first_name.titleize %> <%= comment.user.last_name.titleize %></small> <%= link_to new_link_comment_reply_path(@link, comment) do %><button id="reply-button" class="btn btn-primary"><small>Reply</small></button><% end %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "replies".* FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 14]]