app/views/links/_links.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = $1  [["link_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
          <td><a href="<%= Link.add_http(link.url) %>" target="_blank"><%= Link.add_http(link.url) %></a></td>
          <td><%= link.comments.count %></td>
          <td><%= link.user.first_name.titleize %></td>