app/controllers/comments_controller.rb

	def edit
		@comment = Comment.find(params[:id])
		@link = Link.find(params[:link_id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 8]]