app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("body", "link_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "gyhdfgh"], ["link_id", 8], ["created_at", "2015-08-12 19:05:21.253927"], ["updated_at", "2015-08-12 19:05:21.253927"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 2], ["updated_at", "2015-08-12 19:05:21.284341"], ["id", 1]]
---
	def create
		@link = Link.find(params[:link_id])
		@comment = @link.comments.create(comment_params)
		@comment.user = current_user

		if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "hello"], ["updated_at", "2015-08-12 19:25:57.022745"], ["id", 6]]
---
	def update
		@comment = Comment.find(params[:id])
		@comment.update_attributes(comment_params)

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "comments".* FROM "comments" WHERE "comments"."link_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["link_id", 6], ["id", 7]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
	def destroy
		@link = Link.find(params[:link_id])
		@comment = @link.comments.find(params[:id])
		@comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 9]]
---
	def upvote
		@comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 10]]
---
	def downvote
	  	@comment = Comment.find(params[:id])