app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Yo yo yo"], ["url", "google.com"], ["user_id", 1], ["created_at", "2015-08-20 18:55:55.230883"], ["updated_at", "2015-08-20 18:55:55.230883"]]
---
	def create
		user = current_user
		@link = current_user.links.create(link_params)

SELECT "links".* FROM "links"  ORDER BY "links"."cached_votes_score" DESC
---
	def index
		@links = Link.all.order(cached_votes_score: :desc)

UPDATE "links" SET "title" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["title", "funny2"], ["updated_at", "2015-08-12 19:47:08.567160"], ["id", 8]]
---
	def update
		@link = Link.find(params[:id])
		@link.update_attributes(comment_params)

DELETE FROM "links" WHERE "links"."id" = $1  [["id", 4]]
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 5]]
---
	def destroy
		Link.find(params[:id]).destroy