app/controllers/links_controller.rb

SELECT "links".* FROM "links"  ORDER BY "links"."created_at" DESC
---
	def index
		@links = Link.all.order(created_at: :desc)