app/controllers/replies_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 13]]
---
	def new
		@link = Link.find(params[:link_id])
		@comment = Comment.find(params[:comment_id])

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "replies" ("body", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "jhyhgj"], ["comment_id", 8], ["created_at", "2015-08-18 19:47:20.206151"], ["updated_at", "2015-08-18 19:47:20.206151"]]
UPDATE "replies" SET "user_id" = $1, "link_id" = $2, "updated_at" = $3 WHERE "replies"."id" = $4  [["user_id", 1], ["link_id", 8], ["updated_at", "2015-08-19 14:37:23.622706"], ["id", 14]]
---
	def create
		@link = Link.find(params[:link_id])
		@comment = Comment.find(params[:comment_id])
		@reply = @comment.replies.create(reply_params)
		@reply.user = current_user
		@reply.link_id = @link.id
		@reply.save

SELECT "replies".* FROM "replies"
---
	def index
		@comment = Comment.find(params[:comment_id])
		@replies = @comment.replies.all

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 11]]
SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT 1  [["id", nil]]
---
	def upvote
		@comment = Comment.find(params[:comment_id])
		@reply = Reply.find(params[:reply_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 11]]
SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT 1  [["id", 18]]
---
	def downvote
	  	@comment = Comment.find(params[:comment_id])
	  	@reply = Reply.find(params[:reply_id])